driver-tests/sqlse/db2/SqlSE1178_DB2/DeleteWithMultiParamFullJbi/test/SqlSE1178_DB2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:DeleteWithMultiParamFullRequest>
      <sql:param1>1</sql:param1>
      <sql:param2>bangalore</sql:param2>
    </sql:DeleteWithMultiParamFullRequest>
  </soapenv:Body>
</soapenv:Envelope>